[
    {
        "id": 1,
        "title": "Chicken Biryani",
        "description": "Chicken Biryani is a savory chicken and rice dish that includes layers of chicken, rice, and aromatics that are steamed together. The bottom layer of rice absorbs all the chicken juices as it cooks, giving it a tender texture and rich flavor, while the top layer of rice turns out white and fluffy. Buried in the Biryani, you’ll find whole cuts of succulent chicken bursting with flavor from the potent array of spices, herbs, and aromatics it’s marinated in.",
        "prep_time": "30 minutes",
        "cook_time": "1 hour",
        "total_time": "2 hours 30 minutes",
        "difficulty": "medium",
        "yield": "5 servings",
        "cuisine": "Indian",
        "rating": 5,
        "ingredients": [
            {
                "ing_id": 1,
                "aa_url": "",
                "name": "Vegetable oil",
                "info": "",
                "quantity": "1 tablespoon"
            },
            {
                "ing_id": 2,
                "aa_url": "",
                "name": "Garlic",
                "info": "grated",
                "quantity": "10 grams"
            },
            {
                "ing_id": 3,
                "aa_url": "",
                "name": "Ginger",
                "info": "grated",
                "quantity": "10 grams"
            },
            {
                "ing_id": 4,
                "aa_url": "",
                "name": "Green mirchi",
                "info": "slit",
                "quantity": "2 no.s"
            },
            {
                "ing_id": 5,
                "aa_url": "",
                "name": "Mint leaves",
                "info": "finely chopped",
                "quantity": "5 grams"
            },
            {
                "ing_id": 6,
                "aa_url": "",
                "name": "Corriander leaves",
                "info": "finely chopped",
                "quantity": "10 grams"
            },
            {
                "ing_id": 7,
                "aa_url": "",
                "name": "Garam masala",
                "info": "",
                "quantity": "1 tablespoon"
            },
            {
                "ing_id": 8,
                "aa_url": "",
                "name": "Ground cinnamon",
                "info": "",
                "quantity": "1/2 teaspoon"
            },
            {
                "ing_id": 9,
                "aa_url": "",
                "name": "Salt",
                "info": "",
                "quantity": "1 teaspoon"
            },
            {
                "ing_id": 10,
                "aa_url": "",
                "name": "Chicken",
                "info": "skinless, bone-in",
                "quantity": "1 kg"
            },
            {
                "ing_id": 11,
                "aa_url": "",
                "name": "Water",
                "info": "",
                "quantity": "6 cups"
            },
            {
                "ing_id": 9,
                "aa_url": "",
                "name": "Salt",
                "info": "",
                "quantity": "2.5 teaspoons"
            },
            {
                "ing_id": 12,
                "aa_url": "",
                "name": "Green cardamon",
                "info": "smashed",
                "quantity": "5 no.s"
            },
            {
                "ing_id": 13,
                "aa_url": "",
                "name": "Cumin seeds",
                "info": "",
                "quantity": "1 teaspoon"
            },
            {
                "ing_id": 14,
                "aa_url": "",
                "name": "Bay leaf",
                "info": "",
                "quantity": "1 no"
            },
            {
                "ing_id": 15,
                "aa_url": "",
                "name": "Basmati rice",
                "info": "~ 2 cups",
                "quantity": "360 grams"
            },
            {
                "ing_id": 16,
                "aa_url": "",
                "name": "Ghee",
                "info": "",
                "quantity": "2 tablespoon"
            },
            {
                "ing_id": 17,
                "aa_url": "",
                "name": "Medium onions",
                "info": "sliced thin",
                "quantity": "2 no.s"
            },
            {
                "ing_id": 18,
                "aa_url": "",
                "name": "Reserved boiling liquid",
                "info": "from rice",
                "quantity": "1 cup"
            },
            {
                "ing_id": 19,
                "aa_url": "",
                "name": "Saffron threads",
                "info": "",
                "quantity": "1/2 teaspoon"
            },
            {
                "ing_id": 6,
                "aa_url": "",
                "name": "Corriander leaves",
                "info": "finely chopped for garnishing",
                "quantity": "5 grams"
            }
        ],
        "steps": [
            "To marinate the chicken for the biryani, combine the vegetable oil, garlic, ginger, chili peppers, mint, cilantro, garam masala, cinnamon and salt in a large bowl and stir together. Add the chicken pieces and toss together making sure the chicken is thoroughly coated in the marinade. Allow the chicken to marinate for at least 1 hour or up to overnight.",
            "In a pot wide enough to hold the chicken in a single layer, add the ghee and onions and saute the onions until they are well caramelized (15-20 minutes). Transfer the caramelized onions to a bowl and set aside.",
            "While the onions caramelize, prepare the rice by washing in a strainer under cold running water until the water runs clear.",
            "To par-boil the rice, add the water, salt, cardamom, cumin and bay leaf to a pot and bring to a boil. Add the rice and boil for 7 minutes. Drain the rice, reserving 1 cup of the liquid.",
            "In the pot you caramelized the onions in, add the chicken in a single layer, skin-side down. Fry until golden brown on one side (about 5 minutes). Flip the chicken over and fry the other side until golden brown. Transfer the chicken back to the bowl you marinated it in.",
            "To assemble the biryani, add the saffron to the rice and toss to distribute evenly. Add half the rice mixture to the bottom of the pot you browned the chicken in.",
            "Top the rice with the chicken in a single layer.",
            "Top the chicken with an even layer of caramelized onions.",
            "Finish putting together the Biryani by adding the rest of the rice in an even layer. Add 1 cup of reserved liquid from boiling the rice. Cover the pot with a lid and put the pot on the stove over medium heat and set the timer for 20 minutes. When you can see steam escaping from under the lid, turn down the heat to low and continue cooking until the timer goes off and then turn off the heat.",
            "Without opening the lid, set the timer for another 10 minutes to steam the biryani.",
            "Mix the Chicken Biryani together and then transfer to a serving platter. Garnish with fresh cilantro and serve."
        ],
        "image": "./images/Chicken Biryani.jpeg"
    }
]